# coding: utf-8
# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# 仕様：

# valueObjectは具体的なファイル名、機能をもたせることでファイル名を少し曖昧にする

# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# import
from dataclasses import dataclass
from domain.values.prompt_content import PromptContent

# ----------------------------------------------------------------------------------
# **********************************************************************************

@dataclass(frozen=True)
class Prompt:
    content: PromptContent

    def length(self) -> int:
        return self.content.length()

# **********************************************************************************
