# coding: utf-8
# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# 仕様：メッセージ送信能力を定義するポート

# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# import
from typing import Protocol
from domain.values.room_id import RoomId
from domain.values.chat_msg_content import ChatMsgContent


# ----------------------------------------------------------------------------------
# **********************************************************************************


class MsgSenderPort(Protocol):
    def send_msg(self, room_id: RoomId, msg: ChatMsgContent) -> None:
        ...

# **********************************************************************************
