# coding: utf-8
# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# 仕様：メッセージ送信能力を定義するポート

# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# import
from typing import Protocol
from domain.values.room_id import RoomId
from src.domain.values.msg_content import MsgContent


# ----------------------------------------------------------------------------------
# **********************************************************************************


class MsgSenderPort(Protocol):
    def send_msg(self, room_id: RoomId, msg: MsgContent) -> None:
        ...

# **********************************************************************************
