# coding: utf-8
# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# 仕様：LLM等のテキスト生成サービスを利用するためのPort

# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# import
from typing import Protocol
from src.domain.entities.llm.prompt import Prompt
from src.domain.entities.llm.response import Response

# ----------------------------------------------------------------------------------
# **********************************************************************************


class TextGeneratorPort(Protocol):
    def execute(self, Msg: Prompt) -> Response:
        ...

# **********************************************************************************
