# coding: utf-8
# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# 仕様：
# GetNewMsgRequest が room_id を保持できることを確認する。
# 確認方法: 生成後に room_id を assert。
# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# import

from src.application.dtos.get_new_msg import GetNewMsgRequest

# ----------------------------------------------------------------------------------


def test_get_new_msg_request_success():
    req = GetNewMsgRequest(room_id="123")
    assert req.room_id == "123"

# **********************************************************************************
