# coding: utf-8
# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# 仕様：Promptの値の制限をもたせる

# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# import
from dataclasses import dataclass


# ----------------------------------------------------------------------------------
# **********************************************************************************

@dataclass(frozen=True)
class ChatMsgContent:
    value: str

    # 不正な値を除外
    def __post_init__(self):
        if not self.value:
            raise ValueError("プロンプトが空です")

        if len(self.value) > 2000:
            raise ValueError("ChatMsgは2000文字以内にしてください")
    
    def length(self) -> int:
        return len(self.value)

# **********************************************************************************
