# coding: utf-8
# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# 仕様：返信の値に制限をもたせる

# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# import
from dataclasses import dataclass


# ----------------------------------------------------------------------------------
# **********************************************************************************

@dataclass(frozen=True)
class ReplyContent:
    value: str

    # 不正な値を除外
    def __post_init__(self):
        # 型チェック
        if not isinstance(self.value, str):
            raise ValueError("文字列ではありません")
        
        # Noneチェック
        if not self.value.strip():
            raise ValueError("送信メッセージの値がありません")

# **********************************************************************************
