# coding: utf-8
# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# 仕様：
# ValueObjectは基本、値の変更はNG → ValueObjectの原則に一致 → frozen=True
# 値が入ってきたときに全く空のの値もNGにするために、__post_init__でバリデーションを実施

# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# import
from dataclasses import dataclass


# ----------------------------------------------------------------------------------
# **********************************************************************************


@dataclass(frozen=True)
class RoomId:
    value: str

    def __post_init__(self):
        if not self.value:
            raise ValueError("値が送信先の指定がありません")

# **********************************************************************************
