# coding: utf-8
# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# 仕様：
# ValueObjectは基本、値の変更はNG → ValueObjectの原則に一致 → frozen=True
# 値が入ってきたときに全く空のの値もNGにするために、__post_init__でバリデーションを実施

# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# import
from dataclasses import dataclass


# ----------------------------------------------------------------------------------
# **********************************************************************************


@dataclass(frozen=True)
class SlackChannelId:
    value: str

    # 不正な値を除外
    def __post_init__(self):

        # 型チェック（ここが一番最初）
        if not isinstance(self.value, str):
            raise ValueError("channel_idは文字列型である必要があります")
        
        # Noneチェック
        if not self.value.strip():
            raise ValueError("値が送信先の指定がありません")

# **********************************************************************************
