# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# interfaceのみ定義するファイル
#! ここでは抽象化以外の定義は禁止

#! 下記の定義以外は記述しない


# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# import
from typing import Protocol

# ----------------------------------------------------------------------------------


# ----------------------------------------------------------------------------------
# **********************************************************************************
# ...（Ellipsis）は予約オブジェクト（省略記号）
# 「実装がない」「抽象だ」 という意図を示すために使う。
# passはなにもしないことを示すキーワード

class ChatworkClient(Protocol):
    # 下記が契約内容→Protocolによって制御している
    # メソッド名もpostで統一してないとエラーになる
    # 戻り値がstrであることも契約内容
    def post(self, message: str) -> str:
        ...
    

# **********************************************************************************
