# coding: utf-8
# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# 仕様：

# valueObjectは具体的なファイル名、機能をもたせることでファイル名を少し曖昧にする

# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# import
from dataclasses import dataclass
from src.domain.values.msg_content import MsgContent

# ----------------------------------------------------------------------------------
# **********************************************************************************

@dataclass(frozen=True)
class Msg:
    id: MsgContent
    content: MsgContent
    
    # 文字数のステータス
    def length(self) -> int:
        return len(self.content.value)

# **********************************************************************************
