# coding: utf-8
# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# 仕様：

# valueObjectは具体的なファイル名、機能をもたせることでファイル名を少し曖昧にする


# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# import
from dataclasses import dataclass
from domain.values.room_id import RoomId

# ----------------------------------------------------------------------------------
# **********************************************************************************


@dataclass(frozen=True)
class RoomId:
    id: RoomId
    value: str
    
    # 文字数のステータス
    def length(self) -> int:
        return len(self.content.value)

# **********************************************************************************
