# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# リクエストする際のDTOを定義
#! ここではEnumは定義NG

#! 下記の定義以外は記述しない
# 例）
# class CreateMessageDTO(BaseModel):
#     text: str

# $$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
# import
from enum import Enum
from pydantic import BaseModel

# ----------------------------------------------------------------------------------

from .model_enum import ChatgptModel


# ----------------------------------------------------------------------------------
# **********************************************************************************


class ChatgptResponseValue(BaseModel):
    chatwork_message: str
    is_error: bool = False